require("dotenv/config");
const { Bot, Keyboard, InlineKeyboard } = require("grammy");
const { hydrateApi, hydrateContext } = require("@grammyjs/hydrate");
const connectDB = require("./index");
const Worker = require("./models/Worker");
const mainMenu = require("./keyboards/mainMenu");
const backToMainMenu = require("./keyboards/backToMainMenu");
const ethicsMenu = require("./keyboards/1-profEthicDocs/ethicsMenu");
const {
  hcpInteractionMenu,
  hcpInteractionWithoutPoz,
  hcpInteractionWithoutPozRequirements,
  hcpInteractionWithPoz,
} = require("./keyboards/2-POZ/poz");
const {
  createEvent,
  createEventConfirm,
  createEventConfirmBusiness,
  createEventConfirmSciences,
  createEventConfirmPolicy,
} = require("./keyboards/3-createEvent/createEvent");
const {
  shareSupport,
  shareSupportReject,
  shareSupportConfirm,
  shareSupportRejectEducation,
  shareSupportRejectPublication,
  shareSupportRejectPatients,
  shareSupportRejectCongress,
  shareSupportRejectCharity,
  shareSupportRejectExplore,
  shareSupportRejectSupport,
} = require("./keyboards/4-shareSupport/shareSupport");
const {
  createPatientsSupport,
  createPatientsSupportPt2,
} = require("./keyboards/5-createPatientsSupport/createPatientsSupport");
const docsTemplates = require("./keyboards/7-docsTemplates/docsTemplates");
const antiCorruption = require("./keyboards/8-antiCorruption/antiCorruption");
const { text } = require("express");
const incrementMenuStat = require("./helpers/menuStat");
const addUser = require("./commands/admin/addUser");
const removeUser = require("./commands/admin/removeUser");
const showVisits = require("./commands/admin/showVisits");
const checkContact = require("./helpers/checkContact");

const bot = new Bot(process.env.BOT_API_KEY);
// bot.use(hydrate());
bot.catch((error) => {
  console.error("Виникла помилка в боті:", error);
});

// bot.use(hydrateContext());
// bot.api.config.use(hydrateApi());

bot.api
  .setMyCommands([
    {
      command: "start",
      description: "запустити бота",
    },
    {
      command: "menu",
      description: "Головне меню",
    },
  ])
  .catch((error) => {
    console.error("Ошибка при установке команд:", error);
  });
connectDB();

const requestContactKeyboard = new Keyboard()
  .requestContact("Відправити номер телефону")
  .resized()
  .oneTime();

bot.command("start", async (ctx) => {
  await ctx.reply(
    "Вітаємо! Будь ласка, надайте свій номер телефону для доступу до бота.",
    { reply_markup: requestContactKeyboard },
  );
});

bot.command("menu", async (ctx) => {
  console.log(ctx.from);
  const telegramId = ctx.from.id;

  try {
    let worker = await Worker.findOne({ telegramId });
    if (worker) {
      await ctx.reply("Вітаємо в головному меню.", { reply_markup: mainMenu });
    } else {
      await ctx.reply("Вибачте, у вас немає доступу до цього бота.");
    }
  } catch (error) {
    console.error("Помилка при аутентифікації користувача:", error);
    await ctx.reply(
      "Виникла помилка при обробці вашого запиту. Спробуйте пізніше.",
    );
  }
});

bot.callbackQuery("backToMainMenu", async (ctx) => {
  const message = ctx.callbackQuery.message;
  const messageChatId = message.chat.id;
  const messageMessageId = message.message_id;
  await ctx.api.editMessageText(
    messageChatId,
    messageMessageId,
    "Вітаємо в головному меню.",
    {
      reply_markup: mainMenu,
    },
  );
  await ctx.answerCallbackQuery();
});

const ADMIN_TELEGRAM_ID = process.env.ADMIN_TELEGRAM_ID;

bot.use(async (ctx, next) => {
  ctx.isAdmin = ctx.from.id === Number(ADMIN_TELEGRAM_ID);
  return next();
});

bot.on("callback_query:data", async (ctx) => {
  const callBackData = ctx.callbackQuery.data;
  const message = ctx.callbackQuery.message;
  const messageChatId = message.chat.id;
  const messageMessageId = message.message_id;
  console.log(callBackData);
  try {
    switch (callBackData) {
      case "ethics-menu":
        await ctx.answerCallbackQuery("Документи з професійної етики");
        await incrementMenuStat("Документи з професійної етики");
        await ctx.api.editMessageText(
          messageChatId,
          messageMessageId,
          "Документи з професійної етики",
          {
            reply_markup: ethicsMenu,
          },
        );
        break;
      //2 ethic menu
      case "hcpInteractionMenu":
        await ctx.answerCallbackQuery(
          "Я хочу взаємодіяти з професіоналами охорони здоров’я (ПОЗ)",
        );
        await incrementMenuStat(
          "Я хочу взаємодіяти з професіоналами охорони здоров’я (ПОЗ)",
        );
        await ctx.api.editMessageText(
          messageChatId,
          messageMessageId,
          "Як ви хочете взаємодіяти?",
          {
            reply_markup: hcpInteractionMenu,
          },
        );
        break;
      case "hcpInteractionWithoutPoz":
        await ctx.answerCallbackQuery(
          "Хочу залучити ПОЗ до участі у заході без надання послуг",
        );
        await ctx.api.editMessageText(
          messageChatId,
          messageMessageId,
          "Хочу залучити ПОЗ до участі у заході без надання послуг",
          {
            reply_markup: hcpInteractionWithoutPoz,
          },
        );
        break;
      case "hcpInteractionWithoutPozRequirements":
        await ctx.answerCallbackQuery("Вимоги і обмеження");
        await ctx.api.editMessageText(
          messageChatId,
          messageMessageId,
          "Вимоги і обмеження",
          {
            reply_markup: hcpInteractionWithoutPozRequirements,
          },
        );
        break;
      case "hcpInteractionWithPoz":
        await ctx.answerCallbackQuery("Хочу залучити ПОЗ до надання послуг");
        await ctx.editMessageText("Хочу залучити ПОЗ до надання послуг", {
          reply_markup: hcpInteractionWithPoz,
        });
        break;
      //3 create event
      case "createEvent":
        await ctx.answerCallbackQuery("Це захід Рош?");
        await incrementMenuStat("Я хочу створити захід");
        await ctx.editMessageText("Це захід Рош?", {
          reply_markup: createEvent,
        });
        break;
      case "createEventConfirm":
        await ctx.answerCallbackQuery("Яка мета?");
        await ctx.editMessageText("Яка мета?", {
          reply_markup: createEventConfirm,
        });
        break;
      case "createEventConfirmBusiness":
        await ctx.answerCallbackQuery("Ділова (комерційна)");
        await ctx.editMessageText("Який тип заходу?", {
          reply_markup: createEventConfirmBusiness,
        });
        break;
      case "createEventConfirmSciences":
        await ctx.answerCallbackQuery("Наукова");
        await ctx.editMessageText("Який тип заходу?", {
          reply_markup: createEventConfirmSciences,
        });
        break;
      case "createEventConfirmPolicy":
        await ctx.answerCallbackQuery("Policy shaping");
        await ctx.editMessageText("Який тип заходу?", {
          reply_markup: createEventConfirmPolicy,
        });
        break;
      // 4 support
      case "shareSupport":
        await ctx.answerCallbackQuery("Policy shaping");
        await incrementMenuStat("Я хочу надати підтримку на запит");
        await ctx.editMessageText(
          "Рош отримує вигоду в обмін на надання підтримки?",
          {
            reply_markup: shareSupport,
          },
        );
        break;
      case "shareSupportReject":
        await ctx.answerCallbackQuery("Це благодійність. Яка мета підтримки?");
        await ctx.editMessageText("Це благодійність. Яка мета підтримки?", {
          reply_markup: shareSupportReject,
        });
        break;
      case "shareSupportConfirm":
        await ctx.answerCallbackQuery("1.Це спонсорство. Який бюджет? ");
        await ctx.editMessageText("1.Це спонсорство. Який бюджет? ", {
          reply_markup: shareSupportConfirm,
        });
        break;
      // 7 docs templates
      case "docsTemplates":
        await ctx.answerCallbackQuery("7.Шаблони документів");
        await incrementMenuStat("Шаблони документів");
        await ctx.editMessageText("Шаблони документів", {
          reply_markup: docsTemplates,
        });
        break;
      // 8 anti corruption
      case "antiCorruption":
        await ctx.answerCallbackQuery("Запобігання корупції");
        await incrementMenuStat("Запобігання корупції");
        await ctx.editMessageText("Запобігання корупції", {
          reply_markup: antiCorruption,
        });
        break;
      //answers in order
      case "hcpInteractionWithoutPozRequirementsGeneral":
        await ctx.editMessageText(
          "Рош Україна уникає надання будь-яких благ ПОЗ  або закладам охорони здоров'я, які можуть бути сприйняті як неправомірні стимули для призначення, рекомендації, закупівлі, замовлення, постачання, використання, продажу, оренди або введення лікарських засобів Roche, і бере до уваги можливе сприйняття таких дій перед тим, як їх здійснити.\n" +
            "ПОЗ має бути зареєстрований в EpicX. \n" +
            "Якщо Ви залучаєте ПОЗ до участі в заході, Ви маєте визначити критерії на підставі яких Ви обираєте саме цього ПОЗ для залучення. \n",
          { reply_markup: backToMainMenu },
        );
        break;
      case "hcpInteractionWithoutPozRequirementsPlace":
        await ctx.editMessageText(
          'Усі заходи мають проводитися у відповідному місці, яке є сприятливим для ділових або наукових потреб і мети заходу. Слід уникати використання екстравагантних місць. "Екстравагантними" ресторанами є: заклади, які визначені як "Fine dining" ($$$$) на сайті tripadvisor.com (рекомендовано використовувати для ділових зустрічей/обідів під час заходів заклади харчування рівня Mid-range ($$ - $$$) категорії "Good for Business meetings"). Екстравагантними" готелями та конгрес-центрами є: \n' +
            "•\tрозкішні готелі (більше 4 зірок);\n" +
            "•\tзаміські клуби;\n" +
            "•\tзаклади, які позиціонують себе як курорти, спа-центри, заклади відпочинку чи розваг;\n" +
            "•\tготелі, які містять казино, незалежно від кількості зірок.\n",
          { reply_markup: backToMainMenu },
        );
        break;
      case "hcpInteractionWithoutPozRequirementsFood":
        await ctx.editMessageText(
          "Офіційні обіди, вітальні прийоми тощо мають бути якісними, але не пишними (розкішними). Відкритий бар заборонено. Усі витрати мають бути в межах лімітів витрат, встановлених Етичним кодексом асоціації виробників інноваційних ліків:\n" +
            "•\tМаксимальна вартість однієї трапези: 1440 грн. з ПДВ;\n" +
            "•\tМаксимальна вартість всіх витрат на гостинність на 1 ПОЗ протягом 1 дня: 2400 грн. з ПДВ;\n" +
            "•\tМаксимальна вартість витрат на одну неперсоналізовану трапезу (наприклад, фуршет під час заходу): 1600 грн. з ПДВ.\n",
          { reply_markup: backToMainMenu },
        );
        break;
      case "hcpInteractionWithoutPozRequirementsDrive":
        await ctx.editMessageText(
          "Літаки: заборонено 1 клас, приватні літаки або чартерні рейси:\n" +
            "Залізничний транспорт: 1 клас дозволяється\n" +
            "Розумні витрати на транспорт під час залучення можуть бути відшкодовані.\n" +
            "Проживання: готелі не більше 4 зірок, заборонені «люксові» готелі.\n",
          { reply_markup: backToMainMenu },
        );
        break;
      case "hcpInteractionWithoutPozInstruction":
        await ctx.editMessageText(
          "Залучення реєструється в RoME під час створення заходу (create – Event) або як окреме залучення (create – Standalone Contract/Standalone Engagement)",
          { reply_markup: backToMainMenu },
        );
        break;
      case "hcpInteractionWithoutPozEvidence":
        await ctx.editMessageText(
          "Обов’язково має бути підписаний договір з ПОЗ і докази участі ПОЗ у заході (сертифікат участі або перелік учасників від організатора).\n Докази завантажуються в RoME.",
          { reply_markup: backToMainMenu },
        );
        break;
      case "hcpInteractionWithPozRequirements":
        await ctx.editMessageText(
          "Обов'язковою умовою взаємодії з ПОЗ в разі залучення до надання послуг або уачсті в заході є укладення письмової угоди з ПОЗ до початку надання послуг або участі у заході. Гонорар ПОЗ за надані послуги не має перевищувати справедливої ринкової ціни (FMV). Для визначення належного рівня гонорару кожен ПОЗ класифікується (Tier 1 (International KOL); Tier 2 (National KOL); Tier 3 (Local KOL) на підставі опитувальника під час реєстрації в EpicX.",
          { reply_markup: backToMainMenu },
        );
        break;
      case "hcpInteractionWithPozCriteria":
        await ctx.editMessageText(
          "Критерії вибору ПОЗ:\n" +
            "•\tВідповідність рівня ПОЗ рівню Заходу;\n" +
            "•\tРезультат, який має бути досягнутий як наслідок запрошення ПОЗ до участі в певному заході;\n" +
            "•\tНаявність у ПОЗ наукового ступеня;\n" +
            "•\tУчасть ПОЗ в клінічних дослідженнях;\n" +
            "•\tНаціональне або регіональне покриття експертизи ПОЗ;\n" +
            "•\tНаявність досвіду унікальних випадків лікування або діагностування;\n" +
            "•\tНаявність наукових публікацій;\n" +
            "•\tІндекс цитування Hirsch;\n" +
            "•\tЧи впроваджує ПОЗ нові методи лікування одним із перших («зірка, що сходить»).\n",
          { reply_markup: backToMainMenu },
        );
        break;
      case "hcpInteractionWithPozEvidence":
        await ctx.editMessageText(
          "Збирання доказів правомірного і етичного залучення\n" +
            "Обов’язково має бути підписаний договір з ПОЗ і докази участі ПОЗ у заході (сертифікат участі або перелік учасників від організатора). Докази завантажуються в RoME. ",
          { reply_markup: backToMainMenu },
        );
        break;
      case "createEventConfirmBusinessAdvisory":
        await ctx.editMessageText(
          "<b>Що таке консультативна рада?</b>\n" +
            "Рош Україна форум, на якому група експертів у конкретній галузі запрошена для надання консультацій та внесення пропозицій у своїй сфері компетенції.\n\n" +
            "<b>Хто може ініціювати проведення консультативної ради?</b>\n" +
            "PPoC або Market Enabler\n\n" +
            "<b>Хто затверджує проведення консультативної ради?</b>\n" +
            "•\tTAL (бюджет до 5 тисяч Євро); \n" +
            "•\tCustomer Experience Lead (бюджет від 5 до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро); \n" +
            "•\tGM (бюджет більше 50 тисяч Євро).\n" +
            "\n" +
            "Якщо захід передбачає витрати на організацію заходу, комерційну пропозицію постачальника затверджує Procurement. \n\n" +
            "<b>Які документи необхідні для ініціювання проведення консультативної ради і підтвердження її проведення (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tПроєкт запрошення ПОЗ;\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tРішення консультативної ради за результатами розгляду питань програми.\n" +
            "\n" +
            "Всі документи (копії) мають бути завантажені в RoME.\n\n" +
            "<b>Які ще є особливості?</b>\n" +
            "•\tЗасідання консультативної ради повинні бути спрямовані виключно на отримання порад для конкретної, затвердженої і задокументованої (в RoME) ділової або наукової (медичної) мети. \n" +
            "•\tКонсультативні ради заборонено використовувати для інших цілей, таких як встановлення стосунків. Надана інформація повинна стосуватися лише того, що необхідно для надання обґрунтованих порад. Більшу частину часу засідання слід присвятити збиранню цих порад.\n" +
            "•\tЯкщо обговорюється будь-яка off-label або pre-approval інформація, слід надати чітке застереження всім учасникам. \n" +
            "•\tСлід задокументувати (і додати в RoME), як поради були використані або причини, чому вони не були використані.\n" +
            "•\tКількість радників повинна бути мінімальною, необхідною для отримання якісних порад. Як загальне правило, максимальна кількість радників не повинна перевищувати 20.\n" +
            "•\tУчасть співробітників Рош Україна в засіданнях консультативної ради повинна бути обмежена тими, хто необхідний для досягнення цілей засідання або для прослуховування та збору порад.\n",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "createEventConfirmBusinessCongress":
        await ctx.editMessageText(
          "<b>Що таке відвідування конгресу?</b>\n" +
            "Підтримка участі наших клієнтів (зокрема, ПОЗ) у медичних конгерсах індивідуально або групою. \n" +
            "\n" +
            "<b>Хто може ініціювати відвідування конгресу?</b>\n" +
            "PPoC або Market Enabler\n" +
            "\n" +
            "<b>Хто затверджує відвідування конгресу?</b>\n" +
            "•\tTAL (бюджет до 5 тисяч Євро); \n" +
            "•\tCustomer Experience Lead (бюджет від 5 до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро); \n" +
            "•\tGM (бюджет більше 50 тисяч Євро).\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Комерційну пропозицію постачальника затверджує Procurement.\n\n" +
            "<b>Які документи необхідні для ініціювання відвідування конгресу і підтвердження проведення заходу (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу (з фотографіями (з фотографіями та доказами участі залучених ПОЗ, наприклад, сертифікатами участі ПОЗ у заході або переліком відвідувачів заходу (attendance sheet) від організатора).\n" +
            "Всі документи (копії) мають бути завантажені в RoME.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "createEventConfirmBusinessProduct":
        await ctx.editMessageText(
          "<b>Що таке захід щодо запуску продукту?</b>\n" +
            "Це зустріч, яка включає освітні заходи для ПОЗ, які зосереджені у галузі знань всіх аспектів, пов'язаних із запуском продукту. Метою є ефективна консолідація всієї відповідної наукової інформації щодо продукту. Це навчання надається експертами з кваліфікацією/досвідом у галузі освіти та з клінічним терапевтичним досвідом, а також командою бренду.\n\n" +
            "<b>Хто може ініціювати запуск продукту?</b>\n" +
            "PPoC або Market Enabler\n\n" +
            "<b>Хто затверджує запуск продукту?</b>\n" +
            "•\tTAL (бюджет до 5 тисяч Євро); \n" +
            "•\tCustomer Experience Lead (бюджет від 5 до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро); \n" +
            "•\tGM (бюджет більше 50 тисяч Євро).\n\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Комерційну пропозицію постачальника затверджує Procurement. \n\n" +
            "<b>Які документи необхідні для ініціювання запуску продукту і підтвердження проведення заходу (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу (з фотографіями та доказами участі залучених ПОЗ, наприклад, сертифікатами участі ПОЗ у заході або переліком відвідувачів заходу (attendance sheet) від організатора).\n" +
            "\n" +
            "Всі документи (копії) мають бути завантажені в RoME.\n",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "createEventConfirmBusinessPromo":
        await ctx.editMessageText(
          "<b>Що таке виступ спікера?</b>\n" +
            "Надання ПОЗ (спікером) послуги виступу на підставі письмового договору. Виступ може відбуватись на симпозіумі, протягом турне спікера, під час надання свідчень або зйомки інтерв'ю тощо.\n\n" +
            "<b>Хто може ініціювати залучення спікера до виступу?</b>\n" +
            "PPoC або Market Enabler\n\n" +
            "<b>Хто затверджує виступ спікера?</b>\n" +
            "•\tTAL (бюджет до 5 тисяч Євро); \n" +
            "•\tCustomer Experience Lead (бюджет від 5 до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро); \n" +
            "•\tGM (бюджет більше 50 тисяч Євро);\n" +
            "\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Комерційну пропозицію постачальника затверджує Procurement.\n\n" +
            "<b>Які документи необхідні для ініціювання виступу спікера і підтвердження проведення заходу (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу (з фотографіями та доказами участі залученого ПОЗ, наприклад, сертифікатами участі ПОЗ у заході або переліком відвідувачів заходу (attendance sheet) від організатора).\n" +
            "\n" +
            "Всі документи (копії) мають бути завантажені в RoME.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "createEventConfirmBusinessSymposium":
        await ctx.editMessageText(
          "<b>Що таке симпозіум?</b>\n" +
            "Симпозіум проводиться для публічного обговорення фармацевтики, включаючи поєднання індивідуальних презентацій, панельних дискусій та круглих столів. Захід спрямований на максимізацію взаємодії та навчання від експертів у фармацевтичній сфері.\n\n" +
            "<b>Хто може ініціювати проведення симпозіуму?</b>\n" +
            "PPoC або Market Enabler\n\n" +
            "<b>Хто затверджує проведення симпозіуму?</b>\n" +
            "•\tTAL (бюджет до 5 тисяч Євро); \n" +
            "•\tCustomer Experience Lead (бюджет від 5 до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро); \n" +
            "•\tGM (бюджет більше 50 тисяч Євро).\n\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Комерційну пропозицію постачальника затверджує Procurement.\n\n" +
            "<b>Які документи необхідні для ініціювання симпозіуму і підтвердження проведення заходу (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу (з фотографіями та доказами участі залученого ПОЗ, наприклад, сертифікатами участі ПОЗ у заході або переліком відвідувачів заходу (attendance sheet) від організатора).\n" +
            "Всі документи (копії) мають бути завантажені в RoME.",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "createEventConfirmSciencesAdvisory":
        await ctx.editMessageText(
          "<b>Що таке консультативна рада?</b>\n" +
            "Організований Рош Україна форум, на якому група експертів у конкретній галузі запрошена для надання консультацій та внесення пропозицій у своїй сфері компетенції.\n\n" +
            "<b>Хто може ініціювати проведення консультативної ради?</b>\n" +
            "PPoC або DAE\n\n" +
            "<b>Хто затверджує проведення консультативної ради?</b>\n" +
            "•\tCountry Medical Director (бюджет до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро);\n" +
            "•\tGM (бюджет більше 50 тисяч Євро).\n\n" +
            "Якщо захід передбачає витрати на організацію заходу, комерційну пропозицію постачальника затверджує Procurement.\n\n" +
            "<b>Які документи необхідні для ініціювання проведення консультативної ради і підтвердження її проведення (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tПроєкт запрошення ПОЗ;\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tРішення консультативної ради за результатами розгляду питань програми.\n" +
            "\n" +
            "Всі документи (копії) мають бути завантажені в RoME.\n" +
            "\n" +
            "<b>Які ще є особливості?</b>\n" +
            "•\tЗасідання консультативної ради повинні бути спрямовані виключно на отримання порад для конкретної, затвердженої і задокументованої (в RoME) ділової або наукової (медичної) мети. \n" +
            "•\tКонсультативні ради заборонено використовувати для інших цілей, таких як встановлення стосунків. Надана інформація повинна стосуватися лише того, що необхідно для надання обґрунтованих порад. Більшу частину часу засідання слід присвятити збиранню цих порад.\n" +
            "•\tЯкщо обговорюється будь-яка off-label або pre-approval інформація, слід надати чітке застереження всім учасникам. \n" +
            "•\tСлід задокументувати (і додати в RoME), як поради були використані або причини, чому вони не були використані.\n" +
            "•\tКількість радників повинна бути мінімальною, необхідною для отримання якісних порад. Як загальне правило, максимальна кількість радників не повинна перевищувати 20.\n" +
            "Участь співробітників Рош Україна в засіданнях консультативної ради повинна бути обмежена тими, хто необхідний для досягнення цілей засідання або для прослуховування та збору порад.\n",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "createEventConfirmSciencesCongress":
        await ctx.editMessageText(
          "<b>Що таке відвідування конгресу?</b>\n" +
            "Підтримка участі наших клієнтів (зокрема, ПОЗ) у медичних конгерсах індивідуально або групою. \n\n" +
            "<b>Хто може ініціювати відвідування конгресу?</b>\n" +
            "PPoC або DAE\n\n" +
            "<b>Хто затверджує відвідування конгресу?</b>\n" +
            "•\tCountry Medical Director (бюджет до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро); \n" +
            "•\tGM (бюджет більше 50 тисяч Євро).\n\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Комерційну пропозицію постачальника затверджує Procurement.\n\n" +
            "<b>Які документи необхідні для ініціювання відвідування конгресу і підтвердження проведення заходу (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу (з фотографіями (з фотографіями та доказами участі залучених ПОЗ, наприклад, сертифікатами участі ПОЗ у заході або переліком відвідувачів заходу (attendance sheet) від організатора).\n" +
            "Всі документи (копії) мають бути завантажені в RoME.",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "createEventConfirmSciencesProduct":
        await ctx.editMessageText(
          "<b>Що таке захід щодо запуску продукту?</b>\n" +
            "Це зустріч, яка включає освітні заходи для ПОЗ, які зосереджені у галузі знань всіх аспектів, пов'язаних із запуском продукту. Метою є ефективна консолідація всієї відповідної наукової інформації щодо продукту. Це навчання надається експертами з кваліфікацією/досвідом у галузі освіти та з клінічним терапевтичним досвідом, а також командою бренду.\n\n" +
            "<b>може ініціювати запуск продукту?</b>\n" +
            "PPoC або DAE\n\n" +
            "<b>Хто затверджує запуск продукту?</b>\n" +
            "•\tCountry Medical Director (бюджет до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро); \n" +
            "•\tGM (бюджет більше 50 тисяч Євро).\n\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Комерційну пропозицію постачальника затверджує Procurement.\n\n" +
            "<b>Які документи необхідні для ініціювання запуску продукту і підтвердження проведення заходу (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу (з фотографіями та доказами участі залучених ПОЗ, наприклад, сертифікатами участі ПОЗ у заході або переліком відвідувачів заходу (attendance sheet) від організатора).\n\n" +
            "Всі документи (копії) мають бути завантажені в RoME.",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "createEventConfirmSciencesSwap":
        await ctx.editMessageText(
          "<b>Що таке Post Congress?</b>\n" +
            "Освітній захід, що проводяться після конгресу для інформування ширшої аудиторії ПОЗ про інформацію, представлену на конгресі. Метою такого заходу є надання детальної інформації про досягнення в науці, яка має відображати зміст конгресу.\n\n" +
            "<b>Хто може ініціювати Post Congress?</b>\n" +
            "PPoC або DAE\n\n" +
            "<b>Хто затверджує Post Congress?</b>\n" +
            "В залежності від бюджету заходу:\n" +
            "•\tДо 20 тисяч Євро - Country Medical Director;\n" +
            "•\tВід 20,001 Євро до 50 тисяч Євро - Country Medical Director + Operations Chapter Lead; фбо\n" +
            "•\tБільше 50 тисяч Євро - Country Medical Director + GM.\n\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Якщо захід передбачає витрати на організацію заходу, комерційну пропозицію постачальника затверджує Procurement. \n\n" +
            "<b>Які документи необхідні для ініціювання проведення Post Congress і підтвердження його проведення (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу з фотографіями;\n" +
            "•\tДокази участі залучених лікарів у проведеному заході (сертифікати про участь, списки учасників від організатора, фотозвіт тощо).\n" +
            "Всі документи (копії) мають бути завантажені в RoME.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "createEventConfirmSciencesPreceptor":
        await ctx.editMessageText(
          "<b>Що таке наставництво?</b>\n" +
            "Освітній захід (програма) для ПОЗ, спрямований на покращення знань і розуміння клінічного менеджменту та соціальної допомоги в умовах реального світу, який розроблений для залучення та навчання безпосередньо у медичних працівників, які спеціалізуються на лікуванні конкретної хвороби в умовах реальної клініки.\n\n" +
            "<b>Хто може ініціювати проведення наставництва?</b>\n" +
            "PPoC або DAE\n\n" +
            "<b>Хто затверджує проведення наставництва?</b>\n" +
            "В залежності від бюджету заходу:\n" +
            "•\tДо 20 тисяч Євро - Country Medical Director;\n" +
            "•\tВід 20,001 Євро до 50 тисяч Євро - Country Medical Director + Operations Chapter Lead; або\n" +
            "•\tБільше 50 тисяч Євро - Country Medical Director + GM.\n\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Якщо захід передбачає витрати на організацію заходу, комерційну пропозицію постачальника затверджує Procurement. \n\n" +
            "<b>Які документи необхідні для ініціювання проведення наставництва і підтвердження його проведення (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу з фотографіями;\n" +
            "•\tДокази участі залучених лікарів у проведеному заході (сертифікати про участь, списки учасників від організатора, фотозвіт тощо).\n" +
            "Всі документи (копії) мають бути завантажені в RoME.\n\n" +
            "<b>Які ще є особливості?\n</b>" +
            "•\tЗаклад (база)  для проведення наставництва повинен бути обраний на основі досвіду, відповідної кваліфікації, придатності та якості у конкретній галузі перед затвердженням наставництва;\n" +
            "•\tНаукова потреба проведення наставництва, критерії відбору нзакладу (бази) та участі ПОЗ у наставництві мають бути визначені та зазначені в системі RoME.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "createEventConfirmSciencesRime":
        await ctx.editMessageText(
          "<b>Що таке RIME?</b>\n" +
            "Освітня діяльність (захід або серія заходів) для медичних працівників, яка:\n" +
            "•\tініційована Рош Україна безпосередньо;\n" +
            "•\tініційована третьою стороною від імені (на замовлення) Рош Україна;\n" +
            "•\tініційована третьою стороною безпосередньо, але при наявності впливу Рош Україна на програму (порядок денний, зміст, викладацький склад тощо).\n" +
            "\n" +
            "Заходи, які стосуються медичної освіти (RIME), можуть бути організовані тільки для підвищення рівня знань щодо певного захворювання або його лікування або інформувати про безпечне і ефективне використання лікарського засобу або медичного виробу.\n\n" +
            "Заходи RIME не можуть мати наміром (прямо або опосередковано) промоцію продуктів виробництва Roche (включаючи медичні вироби).\n\n" +
            "<b>Хто може ініціювати проведення освітнього заходу?</b>\n" +
            "PPoC або DAE\n\n" +
            "<b>Хто затверджує проведення освітнього заходу?</b>\n" +
            "В залежності від бюджету заходу:\n" +
            "•\tДо 20 тисяч Євро - Country Medical Director;\n" +
            "•\tВід 20,001 Євро до 50 тисяч Євро - Country Medical Director + Operations Chapter Lead; фбо\n" +
            "•\tБільше 50 тисяч Євро - Country Medical Director + GM.\n\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Якщо захід передбачає витрати на організацію заходу, комерційну пропозицію постачальника затверджує Procurement. \n\n" +
            "<b>Які документи необхідні для ініціювання проведення освітнього заходу і підтвердження його проведення (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tПроєкт запрошення ПОЗ;\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу з фотографіями;\n" +
            "•\tДокази участі залучених лікарів у проведеному заході (сертифікати про участь, списки учасників від організатора, фотозвіт тощо).\n\n" +
            "Всі документи (копії) мають бути завантажені в RoME.\n\n" +
            "<b>Які ще є особливості?</b>\n" +
            "•\tІнформація щодо застосування лікарського засобу Roche до його реєстрації (pre-approval) або не за призначенням (off-label use) може бути частиною освітніх матеріалів лише за умови, що включення такої інформації обумовлено легітимною зареєстрованою науковою потребою, як-от наявність нових даних клінічного випробування, важливих для наукової спільноти;\n" +
            "•\tПОЗ, які залучаються до участі в освітньому заході як учасники (не спікери), мають відповідати встановленим власником заходу критеріям вибору учасників. Такі критерії вибору мають бути зазначені в системі RoME.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "createEventConfirmSciencesInfo":
        await ctx.editMessageText(
          "<b>Що таке обмін науковою інформацією?</b>\n" +
            "Обмін науковою інформацією слід розуміти як непромоційний обмін інформацією між Рош Україна,ПОЗ та науковою спільнотою, що зосереджується на розвитку медичних досліджень, лікуванні захворювань та належному використанні медичних препаратів Roche з метою покращення наукового розуміння та прогресу задля забезпечення найкращого можливого догляду за пацієнтами. Цей тип заходу ніколи не може носити промоційний характер.\n\n" +
            "<b>Хто може ініціювати проведення обміну науковою інформацією?</b>\n" +
            "PPoC або DAE\n\n" +
            "<b>Хто затверджує проведення обміну науковою інформацією?</b>\n" +
            "В залежності від бюджету заходу:\n\n" +
            "•\tДо 20 тисяч Євро - Country Medical Director;\n" +
            "•\tВід 20,001 Євро до 50 тисяч Євро - Country Medical Director + Operations Chapter Lead; фбо\n" +
            "•\tБільше 50 тисяч Євро - Country Medical Director + GM.\n\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Якщо захід передбачає витрати на організацію заходу, комерційну пропозицію постачальника затверджує Procurement.\n\n" +
            "<b>Які документи необхідні для ініціювання проведення обміну науковою інформацією і підтвердження його проведення (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу з фотографіями;\n" +
            "•\tДокази участі залучених лікарів у проведеному заході (сертифікати про участь, списки учасників від організатора, фотозвіт тощо).\n\n" +
            "Всі документи (копії) мають бути завантажені в RoME.",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "createEventConfirmPolicyAdvisory":
        await ctx.editMessageText(
          "<b>Що таке консультативна рада?</b>\n" +
            "Організований Рош Україна форум, на якому група експертів у конкретній галузі запрошена для надання консультацій та внесення пропозицій у своїй сфері компетенції.\n\n" +
            "<b>Хто може ініціювати проведення консультативної ради?</b>\n" +
            "HSP\n\n" +
            "<b>Хто затверджує проведення консультативної ради?</b>\n" +
            "•\tPolicy & Access Excellence Lead (бюджет до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро); \n" +
            "•\tGM (бюджет більше 50 тисяч Євро).\n\n" +
            "Якщо захід передбачає витрати на організацію заходу, комерційну пропозицію постачальника затверджує Procurement.\n\n" +
            "<b>Які документи необхідні для ініціювання проведення консультативної ради і підтвердження її проведення (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tПроєкт запрошення ПОЗ;\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tРішення консультативної ради за результатами розгляду питань програми.\n\n" +
            "Всі документи (копії) мають бути завантажені в RoME.\n\n" +
            "<b>Які ще є особливості?</b>\n" +
            "•\tЗасідання консультативної ради повинні бути спрямовані виключно на отримання порад для конкретної, затвердженої і задокументованої (в RoME) ділової або наукової (медичної) мети. \n" +
            "•\tКонсультативні ради заборонено використовувати для інших цілей, таких як встановлення стосунків. Надана інформація повинна стосуватися лише того, що необхідно для надання обґрунтованих порад. Більшу частину часу засідання слід присвятити збиранню цих порад.\n" +
            "•\tЯкщо обговорюється будь-яка off-label або pre-approval інформація, слід надати чітке застереження всім учасникам. \n" +
            "•\tСлід задокументувати (і додати в RoME), як поради були використані або причини, чому вони не були використані.\n" +
            "•\tКількість радників повинна бути мінімальною, необхідною для отримання якісних порад. Як загальне правило, максимальна кількість радників не повинна перевищувати 20.\n" +
            "Участь співробітників Рош Україна в засіданнях консультативної ради повинна бути обмежена тими, хто необхідний для досягнення цілей засідання або для прослуховування та збору порад.",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "createEventConfirmPolicySpeaker":
        await ctx.editMessageText(
          "<b>Що таке виступ спікера?</b>\n" +
            "Надання ПОЗ (спікером) послуги виступу на підставі письмового договору. Виступ може відбуватись на симпозіумі, протягом турне спікера, під час надання свідчень або зйомки інтерв'ю тощо.\n" +
            "<b>Хто може ініціювати залучення спікера до виступу?</b>\n" +
            "HSP\n\n" +
            "<b>Хто затверджує виступ спікера?</b>\n" +
            "•\tPolicy & Access Excellence Lead (бюджет до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро); \n" +
            "•\tGM (бюджет більше 50 тисяч Євро);\n\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Комерційну пропозицію постачальника затверджує Procurement.\n\n" +
            "<b>Які документи необхідні для ініціювання виступу спікера і підтвердження проведення заходу (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу (з фотографіями та доказами участі залученого ПОЗ, наприклад, сертифікатами участі ПОЗ у заході або переліком відвідувачів заходу (attendance sheet) від організатора).\n\n" +
            "Всі документи (копії) мають бути завантажені в RoME.\n",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "createEventConfirmPolicySymposium":
        await ctx.editMessageText(
          "<b>Що таке симпозіум?</b>\n" +
            "Симпозіум проводиться для публічного обговорення фармацевтики, включаючи поєднання індивідуальних презентацій, панельних дискусій та круглих столів. Захід спрямований на максимізацію взаємодії та навчання від експертів у фармацевтичній сфері.\n\n" +
            "<b>Хто може ініціювати проведення симпозіуму?</b>\n" +
            "HSP\n\n" +
            "<b>Хто затверджує проведення симпозіуму?</b>\n" +
            "•\tPolicy & Access Excellence Lead (бюджет до 20 тисяч Євро); \n" +
            "•\tOperations Chapter Lead (бюджет від 20 до 50 тисяч Євро); \n" +
            "•\tGM (бюджет більше 50 тисяч Євро).\n\n" +
            "За бажанням ініціатора (власника) заходу або затверджуючого захід може бути переданий на затвердження Compliance. Комерційну пропозицію постачальника затверджує Procurement.\n\n" +
            "<b>Які документи необхідні для ініціювання симпозіуму і підтвердження проведення заходу (докази)?</b>\n" +
            "•\tПрограма заходу;\n" +
            "•\tКомерційна пропозиція (якщо очікується замовлення послуг організації заходу, транспортні послуги тощо) або завдання на тендер (якщо очікувана сума витрат перевищує 600 тисяч гривень);\n" +
            "•\tУкладені угоди з ПОЗ;\n" +
            "•\tЗвіт про проведення заходу (з фотографіями та доказами участі залученого ПОЗ, наприклад, сертифікатами участі ПОЗ у заході або переліком відвідувачів заходу (attendance sheet) від організатора).\n\n" +
            "Всі документи (копії) мають бути завантажені в RoME.",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "shareSupportRejectEducation":
        await ctx.answerCallbackQuery("Медична освіта");
        await ctx.editMessageText("Мета підтримки - Медична освіта", {
          reply_markup: shareSupportRejectEducation,
        });
        break;
      case "shareSupportRejectEducationSmall":
        await ctx.editMessageText(
          "<b>Бюджет менше 10 тисяч Євро</b>\n\n" +
            "<b>Обмеження:</b>\n\n" +
            "•\tМетою надання підтримки для IME має бути підвищення спроможності наукової спільноти піклуватися про пацієнтів. Заходи IME ніколи не повинні використовуватися або подаватися як промоційні інструменти;\n" +
            "•\tПостачальник IME повинен бути незалежною третьою стороною, яка має повний контроль над розробкою та вибором усіх аспектів заходу, включаючи програму, зміст та залучення спікерів;\n" +
            "•\tРош Україна не повинно проводити жодного рецензування або надавати, створювати, впливати чи презентувати будь-який освітній контент, включаючи рецензування на предмет наукової точності, для будь-якого заходу IME, підтриманого повністю або частково Рош Україна;\n" +
            "•\tРош Україна не повинно пропонувати або обирати окремих спікерів, навіть якщо цього вимагає постачальник IME;\n" +
            "•\tПрограма заходу має мати широкий об'єм і не фокусуватись на одному терапевтичному рішенні (одному продукті);\n" +
            "•\tЯкщо постачальник IME дозволяє окрему промоційну зону (наприклад, виставкові стенди), Рош Україна може фінансувати і надавати промоційну інформацію та матеріали в таких промоційних зонах відповідно до керівних принципів постачальника IME та чинних політик і процедур Roche за умови, що інші компанії-спонсори також беруть участь у таких промоційних заходах. Така активність має бути чітко промаркована як промоційна;\n" +
            "•\tЯкщо одержувач підтримки (або афілійована особа такого одержувача) одночасно надає послуги Рош Україна, такий одержувач повинен засвідчити Рош Україна (у договорі про підтримку або іншим чином), що в його організації існує належний захисний бар'єр (відокремлення працівників та інформації) між підрозділами, які надають ці послуги Рош Україна, і підрозділом, що отримує підтримку IME та реалізує заходи IME.\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Country Medical Director\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки);\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "shareSupportRejectEducationBig":
        await ctx.editMessageText(
          "<b>Бюджет 10 тисяч Євро або більше</b>\n" +
            "<b>Обмеження:</b>\n" +
            "•Метою надання підтримки для IME має бути підвищення спроможності наукової спільноти піклуватися про пацієнтів. Заходи IME ніколи не повинні використовуватися або подаватися як промоційні інструменти;\n" +
            "•Постачальник IME повинен бути незалежною третьою стороною, яка має повний контроль над розробкою та вибором усіх аспектів заходу, включаючи програму, зміст та залучення спікерів;\n" +
            "•Рош Україна не повинно проводити жодного рецензування або надавати, створювати, впливати чи презентувати будь-який освітній контент, включаючи рецензування на предмет наукової точності, для будь-якого заходу IME, підтриманого повністю або частково Рош Україна;\n" +
            "•Рош Україна не повинно пропонувати або обирати окремих спікерів, навіть якщо цього вимагає постачальник IME;\n" +
            "•Програма заходу має мати широкий обєм і не фокусуватись на одному терапевтичному рішенні (одному продукті);\n" +
            "•Якщо постачальник IME дозволяє окрему промоційну зону (наприклад, виставкові стенди), Рош Україна може фінансувати і надавати промоційну інформацію та матеріали в таких промоційних зонах відповідно до керівних принципів постачальника IME та чинних політик і процедур Roche за умови, що інші компанії-спонсори також беруть участь у таких промоційних заходах. Така активність має бути чітко промаркована як промоційна;\n" +
            "•Якщо одержувач підтримки (або афілійована особа такого одержувача) одночасно надає послуги Рош Україна, такий одержувач повинен засвідчити Рош Україна (у договорі про підтримку або іншим чином), що в його організації існує належний захисний барєр (відокремлення працівників та інформації) між підрозділами, які надають ці послуги Рош Україна, і підрозділом, що отримує підтримку IME та реалізує заходи IME.\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Грантовий комітет (Country Medical Director + GM + Operations Chapter Lead + Compliance)\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•Запит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки);\n" +
            "•Протокол обговорення запиту групою попереднього обговорення;\n" +
            "•Підписаний договір\n" +
            "•Лист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectPublication":
        await ctx.editMessageText("Мета підтримки - Незалежна публікація", {
          reply_markup: shareSupportRejectPublication,
        });
        break;
      case "shareSupportRejectPublicationSmall":
        await ctx.editMessageText(
          "<b>Обмеження</b>\n" +
            "•\tПублікація має відповідати вимогам Roche Global Publication Policy (GOV-0100075 v3);\n" +
            "•\tПідтримка не може надаватись індивідуально автору публікації;\n" +
            "•\tОбсяг підтримки має бути чітко визначений і відокремлений від активностей, які стосуються досліджень.\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Country Medical Director\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки);\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином;\n" +
            "•\tКопія виданої публікації.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectPublicationBig":
        await ctx.editMessageText(
          "<b>Обмеження</b>\n" +
            "•\tПублікація має відповідати вимогам Roche Global Publication Policy (GOV-0100075 v3);\n" +
            "•\tПідтримка не може надаватись індивідуально автору публікації;\n" +
            "•\tОбсяг підтримки має бути чітко визначений і відокремлений від активностей, які стосуються досліджень.\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Грантовий комітет (Country Medical Director + GM + Operations Chapter Lead + Compliance)\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки);\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином;\n" +
            "•\tКопія виданої публікації.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectPatients":
        await ctx.editMessageText(
          "Мета підтримки - Підтримка пацієнтської спільноти",
          { reply_markup: shareSupportRejectPatients },
        );
        break;
      case "shareSupportRejectPatientsSmall":
        await ctx.editMessageText(
          "<b>Обмеження</b>\n" +
            "•\tНеобхідно уникати надання підтримки на проведення заходів пацієнтської спільноти в екстравагантних місцях;\n" +
            "•\tЗабороняється надавати підтримку для фінансування подарунків або влаштування розваг чи дозвілля;\n" +
            "•\tВ якості виключення може бути надана підтримка поточних (операційних) витрат організації, якщо це мала організація або стартап пацієнтської спільноти (в такому випадку особлива увага має приділятись забезпеченню незалежності діяльності організації, яка отримує підтримку).\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Country Medical Director\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки);\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectPatientsBig":
        await ctx.editMessageText(
          "<b>Обмеження</b>\n" +
            "•\tНеобхідно уникати надання підтримки на проведення заходів пацієнтської спільноти в екстравагантних місцях;\n" +
            "•\tЗабороняється надавати підтримку для фінансування подарунків або влаштування розваг чи дозвілля;\n" +
            "•\tВ якості виключення може бути надана підтримка поточних (операційних) витрат організації, якщо це мала організація або стартап пацієнтської спільноти (в такому випадку особлива увага має приділятись забезпеченню незалежності діяльності організації, яка отримує підтримку).\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Грантовий комітет (Country Medical Director + GM + Operations Chapter Lead + Compliance)\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки);\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectCongress":
        await ctx.editMessageText("Мета підтримки - Участь у конгресі", {
          reply_markup: shareSupportRejectCongress,
        });
        break;
      case "shareSupportRejectCongressSmall":
        await ctx.editMessageText(
          "<b>Обмеження</b>\n" +
            "•\tНеобхідно уникати надання підтримки на участь в конгресах, якщо конгреси проводяться в екстравагантних місцях;\n" +
            "•\tРозмір підтримки має покривати виключно трансфер, харчування, проживання і реєстраційний внесок на участь у конгресі;\n" +
            "•\tЗабороняється надавати підтримку для фінансування подарунків або влаштування розваг чи дозвілля.\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Country Medical Director\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чітки запит на надання підтримки від Рош Україна, обсяг такої підтримки;\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectCongressBig":
        await ctx.editMessageText(
          "<b>Обмеження</b>\n" +
            "•\tНеобхідно уникати надання підтримки на участь в конгресах, якщо конгреси проводяться в екстравагантних місцях;\n" +
            "•\tРозмір підтримки має покривати виключно трансфер, харчування, проживання і реєстраційний внесок на участь у конгресі;\n" +
            "•\tЗабороняється надавати підтримку для фінансування подарунків або влаштування розваг чи дозвілля.\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Грантовий комітет (Country Medical Director + GM + Operations Chapter Lead + Compliance)\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чітки запит на надання підтримки від Рош Україна, обсяг такої підтримки;\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "Лист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином.\n\n",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectCharity":
        await ctx.editMessageText("Мета підтримки - Оплата членської участі", {
          reply_markup: shareSupportRejectCharity,
        });
        break;
      case "shareSupportRejectCharitySmall":
        await ctx.editMessageText(
          "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Country Medical Director\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки);\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectCharityBig":
        await ctx.editMessageText(
          "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Грантовий комітет (Country Medical Director + GM + Operations Chapter Lead + Compliance)\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки);\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "Лист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectExplore":
        await ctx.editMessageText("Мета підтримки - Дослідження", {
          reply_markup: shareSupportRejectExplore,
        });
        break;
      case "shareSupportRejectExploreSmall":
        await ctx.editMessageText(
          "<b>Обмеження</b>\n" +
            "•\tПідтримка чможе бути надана виключно для наукових досліджень (наприклад, доклінічні дослідження, фундаментальні дослідження, дослідження біомаркерів тощо);\n" +
            "•\tДіяльність, яка призводить до створення клінічних доказів, а також дослідження, де пацієнти є або можуть приймаьти лікарські засоби Roche, повинні виконуватися як клінічні дослідження. Якщо чітке розмежування не є очевидним, необхідно провести попередню оцінку за допомогою дерева ріешнь GCP/GVP та консультацію з фахівцем GVP або іншими відповідними функціями та задокументувати це. Проєкти з дослідження біомаркерів, що аналізують раніше зібрані біологічні зразки пацієнтів, можуть розглядатися як об'єкти підтримки через гранти/пожертви або спонсорство за умови, що зразки не збираються проспективно і результати таких досліджень не матимуть негайного та прямого впливу на лікування пацієнтів;\n" +
            "•\tПідтримка (через гранти/пожертви або спонсорство) для наукових досліджень не може надаватися з метою обійти існуючі процедури (такі як підтримка досліджень, ініційованих дослідниками, фінансованих досліджень, клінічних випробувань, спонсорованих Roche, досліджень, керованих Roche, реєстрів);\n" +
            "•\tДослідження, які підпадають під дію дерева рішень GCP/GVP, не можуть бути підтримані через благодійність (гранти) чи спонсорство;\n" +
            "•\tПовинна бути надійна наукова основа та цінність для підтримки наукових досліджень, а одержувач повинен гарантувати, що до проєкту залучено кваліфікованих дослідників;\n" +
            "•\tНаукові дослідження повинні бути незалежними і не піддаватися впливу з боку Roche.\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Country Medical Director\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки);\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином;\n" +
            "•\tПрограма (методологія) або протокол дослідження.\n" +
            "•\tЗвіт або інший документ, який містить результати дослідження.\n",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectExploreBig":
        await ctx.editMessageText(
          "<b>Обмеження</b>\n" +
            "•\tПідтримка чможе бути надана виключно для наукових досліджень (наприклад, доклінічні дослідження, фундаментальні дослідження, дослідження біомаркерів тощо);\n" +
            "•\tДіяльність, яка призводить до створення клінічних доказів, а також дослідження, де пацієнти є або можуть приймаьти лікарські засоби Roche, повинні виконуватися як клінічні дослідження. Якщо чітке розмежування не є очевидним, необхідно провести попередню оцінку за допомогою дерева ріешнь GCP/GVP та консультацію з фахівцем GVP або іншими відповідними функціями та задокументувати це. Проєкти з дослідження біомаркерів, що аналізують раніше зібрані біологічні зразки пацієнтів, можуть розглядатися як об'єкти підтримки через гранти/пожертви або спонсорство за умови, що зразки не збираються проспективно і результати таких досліджень не матимуть негайного та прямого впливу на лікування пацієнтів;\n" +
            "•\tПідтримка (через гранти/пожертви або спонсорство) для наукових досліджень не може надаватися з метою обійти існуючі процедури (такі як підтримка досліджень, ініційованих дослідниками, фінансованих досліджень, клінічних випробувань, спонсорованих Roche, досліджень, керованих Roche, реєстрів);\n" +
            "•\tДослідження, які підпадають під дію дерева рішень GCP/GVP, не можуть бути підтримані через благодійність (гранти) чи спонсорство;\n" +
            "•\tПовинна бути надійна наукова основа та цінність для підтримки наукових досліджень, а одержувач повинен гарантувати, що до проєкту залучено кваліфікованих дослідників;\n" +
            "•\tНаукові дослідження повинні бути незалежними і не піддаватися впливу з боку Roche.\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Грантовий комітет (Country Medical Director + GM + Operations Chapter Lead + Compliance)\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки);\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином;\n" +
            "•\tПрограма (методологія) або протокол дослідження.\n" +
            "•\tЗвіт або інший документ, який містить результати дослідження.\n",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectSupport":
        await ctx.editMessageText(
          "Мета підтримки - Підтримка інфраструктури (надання обладнання, ремонт)",
          {
            reply_markup: shareSupportRejectSupport,
          },
        );
        break;
      case "shareSupportRejectSupportSmall":
        await ctx.editMessageText(
          "<b>Обмеження</b>\n" +
            "•\tЗагалом, відповідно до принципу незалежності, недоцільно надавати підтримку на поточні (операційні) витрати. Зверніть увагу, що Roche прагне покращити доступ до ефективної, якісної медичної допомоги, в тому числі шляхом зміцнення медичної інфраструктури, що має на меті забезпечити стійке покращення систем охорони здоров'я;\n" +
            "•\tПідтримка інфраструктури здійснюється лише у виключних випадаках;\n" +
            "\n" +
            "•\tПідтримка може надаватись тільки якщо в результаті використання підтримки будуть створені вигоди для пацієнтів або результати лікування пацієнтів будуть значною мірою покращені;\n" +
            "•\tНадання підтримки на інфраструктуру закладів охорони здоров'я завжди погоджується грантовим комітетом (незалежно від обсягу підтримки);\n" +
            "•\tПідтримка на інфраструктуру не може надаватись одному і тому самому отримувачу на постійній основі;\n" +
            "•\tНадана підтримка не може використовуватись для надання платних послуг пацієнтам.\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Грантовий комітет (Country Medical Director + GM + Operations Chapter Lead + Compliance)" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки). Запит на підтримку має обов'язково містити кошторис робіт (якщо потрібні ремонтні роботи) або перелік обладання, яке потребується;\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином;\n" +
            "•\tФотозвіт про використання підтримки.",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportRejectSupportBig":
        await ctx.editMessageText(
          "<b>Обмеження</b>\n" +
            "•\tЗагалом, відповідно до принципу незалежності, недоцільно надавати підтримку на поточні (операційні) витрати. Зверніть увагу, що Roche прагне покращити доступ до ефективної, якісної медичної допомоги, в тому числі шляхом зміцнення медичної інфраструктури, що має на меті забезпечити стійке покращення систем охорони здоров'я;\n" +
            "•\tПідтримка інфраструктури здійснюється лише у виключних випадаках;\n" +
            "\n" +
            "•\tПідтримка може надаватись тільки якщо в результаті використання підтримки будуть створені вигоди для пацієнтів або результати лікування пацієнтів будуть значною мірою покращені;\n" +
            "•\tНадання підтримки на інфраструктуру закладів охорони здоров'я завжди погоджується грантовим комітетом (незалежно від обсягу підтримки);\n" +
            "•\tПідтримка на інфраструктуру не може надаватись одному і тому самому отримувачу на постійній основі;\n" +
            "•\tНадана підтримка не може використовуватись для надання платних послуг пацієнтам.\n\n" +
            "<b>Реєстрація запиту:</b>\n" +
            "RoME після зустрічі групи попереднього обговорення.\n\n" +
            "<b>Хто затверджує?</b>\n" +
            "Грантовий комітет (Country Medical Director + GM + Operations Chapter Lead + Compliance)\n\n" +
            "<b>Які документи потрібні?</b>\n" +
            "•\tЗапит на підтримку (має містити опис активності, для якої запитується підтримка, чіткий запит на надання підтримки від Рош Україна, обсяг такої підтримки). Запит на підтримку має обов'язково містити кошторис робіт (якщо потрібні ремонтні роботи) або перелік обладання, яке потребується;\n" +
            "•\tПротокол обговорення запиту групою попереднього обговорення;\n" +
            "•\tПідписаний договір;\n" +
            "•\tЛист-подяка від отримувача підтримки, в якому зазначається, що підтримка була використана належним чином;\n" +
            "•\tФотозвіт про використання підтримки.\n",
          { reply_markup: backToMainMenu, parse_mode: "HTML" },
        );
        break;
      case "shareSupportConfirm5k":
        await ctx.answerCallbackQuery("Менше 5 тисяч Євро");
        await ctx.editMessageText(
          "В разі спонсорства Рош Україна має отримати реальну вигоду в обмін на надану підтримку. Спонсорська підтримка надається на підставі письмового запиту і укладеного договору. Заборонено надавати спонсорську підтримку на підтримку інфраструктури (ремонт, закупівля обладнання). Запит на спонсорську допомогу реєструється в RoME і затверджується TAL.",
          {
            reply_markup: backToMainMenu,
          },
        );
        break;
      case "shareSupportConfirm10k":
        await ctx.answerCallbackQuery("Від 5 до 10 тисяч Євро");
        await ctx.editMessageText(
          "В разі спонсорства Рош Україна має отримати реальну вигоду в обмін на надану підтримку. Спонсорська підтримка надається на підставі письмового запиту і укладеного договору. Заборонено надавати спонсорську підтримку на підтримку інфраструктури (ремонт, закупівля обладнання). Запит на спонсорську допомогу реєструється в RoME і затверджується Customer Experience Lead.",
          {
            reply_markup: backToMainMenu,
          },
        );
        break;
      case "shareSupportConfirm11k":
        await ctx.answerCallbackQuery("Більше 10 тисяч Євро");
        await ctx.editMessageText(
          "В разі спонсорства Рош Україна має отримати реальну вигоду в обмін на надану підтримку. Спонсорська підтримка надається на підставі письмового запиту і укладеного договору. Заборонено надавати спонсорську підтримку на підтримку інфраструктури (ремонт, закупівля обладнання). Запит на спонсорську допомогу реєструється в RoME і затверджується Комітетом з комерційних питань (GM + Operations Chapter Lead + Compliance + Policy & Access Excellence Lead + Customer Experience Lead).",
          {
            reply_markup: backToMainMenu,
          },
        );
        break;
      case "createPatientsSupport":
        await ctx.answerCallbackQuery(
          "Я хочу створити рішення для підтримки пацієнтів",
        );
        await incrementMenuStat(
          "Я хочу створити рішення для підтримки пацієнтів",
        );
        await ctx.editMessageText(
          "Рішення для пацієнтів - це організована активність, яка проводиться безпосередньо Рош Україна або від імені Рош Україна, яка має на меті надати пряму підтримку пацієнтам, наприклад, допомогу в отриманні правильного діагнозу, доступу до лікування або керуванні перебігу їхнього захворювання. \n" +
            "\n" +
            "Рішення для пацієнтів, в яких існує вірогідність двосторонньої комунікації з пацієнтами, в результаті якої можливе отримання інформації щодо безпечності лікарських засобів Roche (небажані явища), підлягають регулюванню відповідно до “Roche SOP-0102065 Global: Market Research and Patient Support Program Pharmacovigilance” та є програмами підтримки пацієнтів.\n" +
            "\n" +
            "Рішення для пацієнтів повинні бути корисним для пацієнтів. Промоція пацієнтам під час реалізації рішення для пацієнтів заборонена.\n" +
            "\n" +
            "Рішення для пацієнтів не повинні неналежним чином впливати на ПОЗ щодо призначення, запиту, використання, рекомендації або придбання лікарських засобів Roche.\n" +
            "\n" +
            "Під час реалізації рішення для пацієнтів не повинні надаватися матеріальні вигоди для ПОЗ, окрім тих, які необхідні для досягнення мети рішення (наприклад, оплата послуг за договором). Прямі чи непрямі витрати ПОЗ не можуть покриватися або субсидіюватися.\n" +
            "\n" +
            "Будь-які предмети, які передаються учасникам рішення для пацієнта, не підлягають продажу або відшкодування іншим способом. Дизайн рішення для пацієнтів має передбачати контроль цієї вимоги.\n" +
            "\n" +
            "Учасники рішення для пацієнтів не повинні отримувати фінансові стимули, окрім вартості наданих вигод, товарів чи послуг. Вони не повинні сплачувати плату за участь або штраф за відмову від участі в рішенні.\n" +
            "\n" +
            "Лише послуги, що виходять за межі звичайних обов’язків ПОЗ, можуть бути оплачені. Оплата повинна відповідати застосовним регуляціям, вимогам справедливої ринкової вартості (FMV) та підпадати під відповідні вимоги щодо розкриття інформації.\n" +
            "\n" +
            "Обробка персональних даних пацієнтів під час реалізації рішення для пацієнтів дозволяється, але це може створювати ризики неправомірного використання даних та порушення правил конфіденційності.\n" +
            "\n" +
            "Відповідно, всі рішення для пацієнтів повинні бути попередньо перевірені на відповідність глобальній директиві Roche щодо захисту персональних даних, а також на відповідність законодавству України.\n" +
            "\n" +
            "Метою рішення для пацієнтів не може бути збір та обробка персональних даних пацієнтів.\n" +
            "\n" +
            "Якщо рішення для пацієнтів передбачає створення, розробку або використання об'єктів, які можуть бути захищеними правами інтелектуальної власності, відповідні функції (Legal тощо) повинні бути залучені на ранніх етапах розробки дизайну рішення.",
          {
            reply_markup: createPatientsSupport,
          },
        );
        break;
      case "createPatientsSupportPt2":
        await ctx.answerCallbackQuery(
          "Я хочу створити рішення для підтримки пацієнтів ",
        );
        await ctx.editMessageText(
          "Кожен пацієнт має право приймати рішення щодо свого тіла та здоров'я. Для деяких рішень для пацієнтів, де потрібен контакт з пацієнтами, пацієнти повинні надати інформовану згоду на участь в рішенні для пацієнтів, додатково до згоди на обробку персональних даних, включаючи умови припинення участі та завершення рішення для пацієнтів.\n" +
            "\n" +
            "Пацієнти мають право вільно обирати та змінювати свого постачальника медичних послуг. Рішення для пацієнтів не повинні впливати на свободу вибору пацієнтами своїх лікарів та закладів охорони здоров'я, поза участю в рішенні для пацієнтів. Рішення для пацієнтів не повинні бути створені для задоволення інтересів конкретних лікарів чи закладів охорони здоров'я.\n" +
            "\n" +
            "Під час реалізації рішення для пацієнтів потрібно уникати надання медичних консультацій або постановки діагнозів і з таких питань завжди направляти пацієнтів до їхніх лікарів.\n" +
            "\n" +
            "Кожне рішення для пацієнтів має мати власника, який здійснює поточне керівництво рішенням та має повноваження приймати оперативні рішення щодо розвитку рішення для пацієнтів.\n" +
            "\n" +
            "Якщо для реалізації рішення для пацієнтів вимагається залучення сторонніх постачальників, замовлення товарів, робіт або послуг здійнюється відповідно до встановленого порядку закупівель.\n" +
            "\n" +
            "Рішення для пацієнтів затверджуються як спеціальні проєкти відповідно до комерційної політики. \n" +
            "\n" +
            "Під час реалізації рішення для пацієнтів необхідно забезечити загальнодоступність інформації про можливість участі у відповідному рішенні як для всіх належних пацієнтів, так і для всіх задіяних суб'єктів господарювання (аптеки, дистриб'ютори, лабораторії), а також про період тривалості рішення; при цьому має бути недискримінаційний підхід.\n" +
            "\n" +
            "З особливою уважністю потрібно ставитися до умов рішень для пацієнтів у випадку їх проведення стосовно лікарських засобів, що приймаються пожиттєво, оскільки в подальшому пацієнт не зможе відмовитися від цього лікарського засобу, а ціна на нього після закінчення строку дії рішення зросте. Рекомендується розробляти стратегію завершення рішення на етапі розробки дизайну рішення.\n",
          {
            reply_markup: createPatientsSupportPt2,
          },
        );
        break;
      case "createPartnership":
        await ctx.answerCallbackQuery("Я хочу створити партнерство");
        await incrementMenuStat("Я хочу створити партнерство");
        await ctx.editMessageText(
          "<b>Партнерство</b> - це співпраця між Рош Україна та однією або декількома авторитетними організаціями. Угоди, за якими Рош Україна просто надає кошти, не вважаються партнерствами.\n\n" +
            "<b>Ключові ознаки партнерства:</b>\n" +
            "•\tКожна сторона (партнер) повинна зробити значний і чітко визначений внесок у спільний проєкт (внески можуть включати людські ресурси, експертизу, обладнання, канали зв'язку, інформаційні технології та фінанси);\n" +
            "•\tСпільний характер розробки різних елементів партнерства;\n" +
            "•\tВзаємна вигода (приклади вигоди для Рош Україна можуть включати потенційне розширення відповідної та придатної популяції пацієнтів в результаті діяльності, збільшення відповідного використання лікарських засобів у відповідності до місцевих або національних рекомендацій, швидке впровадження політики охорони здоров'я, яка може бути релевантною для бізнесу Рош Україна);\n" +
            "•\tСпільна прихильність до успішного виконання;\n" +
            "•\tСпільні результати досягнення цілей партнерства;\n" +
            "•\tПартнерство має бути прозорим, з чітким визначенням діяльності залучених сторін, і будь-які вимоги щодо розкриття інформації повинні бути виконані, якщо це релевантно.\n\n" +
            "<b>Прийнятні цілі партнерства:</b>\n" +
            "•\tРозробка або створення програм, мереж та проє'ктів, які безпосередньо або опосередковано сприяють збільшенню переваг для пацієнтів і суспільства;\n" +
            "•\tПартнерство у заходах, які учасники не можуть реалізувати самостійно; \n" +
            "•\tСпівпраця в дослідженнях (за умови дотримання відповідних внутрішніх процедур/політик для клінічних досліджень).\n\n" +
            "<b>Заборонені цілі партнерства:</b>\n" +
            "•\tОбхід вимог інших внутрішніх процедур/політик (наприклад, дослідження за ініціативою дослідника, фінансовані дослідження, клінічні випробування, дослідження під управлінням Рош Україна, реєстри, гранти/пожертви, спонсорство тощо);\n" +
            "•\tВстановлення та підтримка стосунків:\n" +
            "•\tДосягнення здебільшого маркетингових або рекламних цілей; \n" +
            "•\tНеправмірна промоція продукції Roche (наприклад, промоція серед пацієнтів);\n" +
            "•\tНеправомірний вплив на регуляторні, цінові, рішення щодо призначення лікарських засобів за рецептом або рішення щодо реімбурсації; \n" +
            "•\tВплив на зміст клінічних протоколів.\n\n" +
            "<b>Форму партнерства ініціатор партнерства може запропонувати самостійно, але за наступних умов:</b>\n" +
            "•\tпроведення попередніх консультацій з представниками функцій, чиї інтереси або повноваження можуть бути зачеплені потенційним партнерством;\n" +
            "•\tпроведення оцінки ризиків потенційного партнерства.\n" +
            "\n" +
            "Рішення про встановлення партнерства приймається Enabling Team.\n",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "antiCorruptionBan":
        await ctx.answerCallbackQuery(
          "Заборона корупції та неправомірної вимоги ",
        );
        await ctx.editMessageText(
          "<b>Ми не терпимо хабарництва або будь-яких інших форм корупційної бізнес-поведінки.</b>\n" +
            "Roche відкидає всі форми корупційної бізнес-поведінки, такі як хабарництво (публічне, приватне, активне та пасивне), розтрата, шахрайство, крадіжка та надання неправомірних переваг. Директива Roche щодо Ділової Доброчесності надає додаткові вказівки з цих питань.\n\n" +
            "<b>Хабарництво</b>\n" +
            "Працівникам Roche та його бізнес-партнерам заборонено давати, обіцяти дати, запрошувати або приймати будь-які форми неправомірних переваг, безпосередньо чи опосередковано, будь-якій особі або організації з намірами отримати або зберегти бізнес у відповідь. Неправомірні переваги включають незаконні знижки, хабарі, відкати та підпільні платежі. Неправомірна перевага може бути будь-якою цінністю, включаючи, але не обмежуючись, платежами, харчуванням, подарунками, розвагами, дорожніми витратами або фіктивними угодами.\n\n" +
            "<b>Надання неправомірних переваг</b>\n" +
            'Однаково заборонено давати або обіцяти надати неправомірну перевагу без конкретного бізнес-рішення на увазі. На відміну від визначення хабарництва, тут немає "послуги в обмін". Неправомірну перевагу тому можна розглядати як "платіж з доброї волі" для збільшення симпатій до дарувальника.\n\n' +
            "Співробітники Roche повинні пам’ятати, що важливо, як їх поведінка виглядає, і що вона може бути розцінена як хабар або надання неправомірної переваги, незалежно від їх намірів.\n\n" +
            "Ці принципи застосовуються по всьому світу до всіх публічних і приватних бізнес-транзакцій, які стосуються Roche. У багатьох країнах існують суворі закони та регулювання щодо хабарів та неправомірних переваг, що призводять до кримінальної та цивільної відповідальності компанії Roche та залучених осіб.\n\n" +
            "Надання переваг бізнес-партнерам та іншим третім сторонам може бути допустимим за умови дотримання всіх вимог, зазначених у Директиві Roche щодо Ділової Доброчесності, та отримання відповідних лоакльних затверджень.",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "antiCorruptionConflict":
        await ctx.answerCallbackQuery("Конфлікт інтересів");
        await ctx.editMessageText(
          "<b>Особисті інтереси не повинні надмірно впливати на наше професійне судження./n</b>" +
            "Конфлікт інтересів виникає тоді, коли особисті інтереси працівника не узгоджуються з інтересами Roche і створюють конфліктуючі лояльності. Як співробітники Roche, ми повинні уникати ситуацій, де наші особисті інтереси конфліктують або здаються такими, що конфліктують з інтересами Roche./n/n" +
            "Діяльність родичів та близьких знайомих може спричиняти конфлікти інтересів. Ми не повинні брати участь, здаватися такими, що беруть участь, або чинити вплив на будь-яке рішення, яке може поставити наші власні інтереси в конфлікт із найкращими інтересами Roche./n/n" +
            "Ми не повинні надмірно використовувати свою позицію в Roche для особистої вигоди або для вигоди родичів чи близьких знайомих. Ми повинні ретельно зважити потенційний конфлікт інтересів перед тим, як прийняти додаткову зайнятість./n/n" +
            "Професійні зобов’язання за межами Roche, включаючи членство в радах директорів третіх сторін, можуть призвести до конфліктів інтересів. Тому працівники можуть приймати членство в радах директорів сторонніх компаній, комерційних структур або наукових консультативних рад тільки після отримання попереднього схвалення відповідного виконавчого директора Roche, як це визначено в Директиві Roche щодо Співробітників, які перебувають у Радах Директорів. Попереднє схвалення не потрібне для членства в радах благодійних, некомерційних та некомерційних організацій (наприклад, спортивні клуби, благодійні організації)./n/n" +
            "Багато реальних або потенційних конфліктів інтересів можуть бути вирішені прийнятним способом як для індивідуума, так і для компанії. У разі конфлікту інтересів, відповідний працівник повинен негайно повідомити свого керівника для пошуку відповідного рішення./n/n" +
            "Сприйняття має значення: співробітники Roche повинні уникати не лише реальних конфліктів інтересів, але й ситуацій, в яких сторонні особи можуть припустити наявність конфлікту інтересів, якого працівник може не передбачати або усвідомлювати.",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
      case "antiCorruptionInform":
        await ctx.answerCallbackQuery(
          "Повідомити про корупцію або конфлікт інтересів (текст з контактами)",
        );
        await ctx.editMessageText(
          "Якщо Ви стали свідком корупційного діяння або ділового рішення, зробленого під впливлом конфлікту інтересів, Ви можете повідомити про це керівнику Compliance або на канал <a href='https://www.roche.com/about/governance/code-of-conduct'>Speak Up</a>\n\n" +
            "Roche гарантує конфіденційність і захист від переслідувань викривачам корупції.\n",
          {
            reply_markup: backToMainMenu,
            parse_mode: "HTML",
          },
        );
        break;
    }
  } catch (error) {
    console.error("Ошибка при ответе на callbackQuery:", error);
  }
  //1 menu docs
});

bot.start();
// Middleware для проверки доступа
bot.use(async (ctx, next) => {
  // Игнорируем обработку команд /start и получение контакта
  if (ctx.message && (ctx.message.text === "/start" || ctx.message.contact)) {
    return next();
  }

  const telegramId = ctx.from.id;

  try {
    const user = await Worker.findOne({ telegramId });

    if (user || Number(ctx.from.id) === Number(process.env.ADMIN_TELEGRAM_ID)) {
      return next();
    } else {
      return ctx.reply(
        "У вас нет доступа к этому боту. Пожалуйста, отправьте свой номер телефона.",
        {
          reply_markup: requestContactKeyboard,
        },
      );
    }
  } catch (error) {
    console.error("Ошибка при проверке доступа:", error);
    return ctx.reply("Произошла ошибка. Попробуйте позже.");
  }
});

bot.use(addUser);
bot.use(removeUser);
bot.use(showVisits);
bot.use(checkContact);

// Обработка завершения работы
process.once("SIGINT", () => bot.stop("SIGINT"));
process.once("SIGTERM", () => bot.stop("SIGTERM"));

// module.exports = bot;
